Tekla Open API Reference for Tekla Structures 2025
BentPlateGeometrySolver.ModifyPolygon Method
 Modify the shape of a polygon section, and updates related cylindrical sections accordingly.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ConnectiveGeometry ModifyPolygon(
	ConnectiveGeometry geometry,
	GeometrySection polygonSection,
	Contour points
)
Public Function ModifyPolygon (
	geometry As ConnectiveGeometry,
	polygonSection As GeometrySection,
	points As Contour
) As ConnectiveGeometry
Parameters
geometry
Type: Tekla.Structures.Model.ConnectiveGeometry
Reference geometry to modify which contains polygonSection.
polygonSection
Type: Tekla.Structures.Model.GeometrySection
A polygon section from geometry to modify.
points
Type: Tekla.Structures.Model.Contour
The modified contour for the section.
Return Value
Type: ConnectiveGeometry
Modified ConnectiveGeometry if command succeeded or geometry otherwise.
Exceptions
Exception | Condition
ConnectiveGeometryException | Thrown if could not modify polygon.
See Also
Reference
BentPlateGeometrySolver Class
Tekla.Structures.Model Namespace